'''
15. Великое Лайнландское переселение
Ограничение времени	1 секунда
Ограничение памяти	256Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
Лайнландия представляет из себя одномерный мир, являющийся прямой, на котором располагаются N городов, последовательно пронумерованных от 0 до N - 1 . Направление в сторону от первого города к нулевому названо западным, а в обратную — восточным.
Когда в Лайнландии неожиданно начался кризис, все были жители мира стали испытывать глубокое смятение. По всей Лайнландии стали ходить слухи, что на востоке живётся лучше, чем на западе.
Так и началось Великое Лайнландское переселение. Обитатели мира целыми городами отправились на восток, покинув родные улицы, и двигались до тех пор, пока не приходили в город, в котором средняя цена проживания была меньше, чем в родном.

Формат ввода
В первой строке дано одно число N (
2
≤
N
≤
1
0
5
) — количество городов в Лайнландии. Во второй строке дано N чисел 
a
i
 (
0
≤
a
i
≤
1
0
9
) — средняя цена проживания в городах с нулевого по (N - 1)-ый соответственно.
Формат вывода
Для каждого города в порядке с нулевого по (N - 1)-ый выведите номер города, в который переселятся его изначальные жители. Если жители города не остановятся в каком-либо другом городе, отправившись в Восточное Бесконечное Ничто, выведите -1 .
'''
N = int(input())
cities = list(map(int, input().split(' ')))
class Stack:
	def __init__(self, N):
		self.stack = []
		self.size_of_ans_array = N
		self.ans = [-1] * N
	
	def show_ans(self):
		for i in range(self.size_of_ans_array):
			print(self.ans[i], end=' ') 
	
	def add(self, val: int, ind: int):
		while (self.size() > 0) and (self.stack[-1][0] > val):
			self.ans[self.stack[-1][1]] = ind
			self.stack.pop()
		self.stack.append([val, ind])
	
	def size(self)->int:
	    return len(self.stack)
    

attempt = Stack(N)
for i in range(len(cities)):
    attempt.add(cities[i], i) 
attempt.show_ans()
